biddr_api/app/controllers/bids_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
INSERT INTO "bids" ("price", "auction_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["price", 0], ["auction_id", 42], ["created_at", "2020-09-08 20:37:35.455595"], ["updated_at", "2020-09-08 20:37:35.455595"], ["user_id", 12]]
SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1 ORDER BY "bids"."created_at" DESC  [["auction_id", 42]]
---
  def create
     @auction = Auction.find params[:auction_id]
     @bid = Bid.new bid_params
     @bid.auction = @auction
     @bid.user = current_user
   if @bid.save
     redirect_to auction_path(@auction)
   else
     @bids = @auction.bids.order(created_at: :desc)

SELECT "bids".* FROM "bids" WHERE "bids"."id" = $1 LIMIT $2  [["id", 198], ["LIMIT", 1]]
DELETE FROM "bids" WHERE "bids"."id" = $1  [["id", 198]]
---
  def destroy
    @bid = Bid.find params[:id]
    if can?(:crud, @bid)
    @bid.destroy