app/controllers/auctions_controller.rb

  def index
    @auctions = Auction.all
---
SELECT "auctions".* FROM "auctions"

  def show
    @bid = Bid.new
    @bids = @auction.bids.order(created_at: :desc)
---
SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1 ORDER BY "bids"."created_at" DESC  [["auction_id", 22]]

  def create
    @auction = Auction.new(auction_params)
    @auction.user = current_user
    respond_to do |format|
      if @auction.save
---
INSERT INTO "auctions" ("title", "description", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @auction.update(auction_params)
---
UPDATE "auctions" SET "title" = $1, "updated_at" = $2 WHERE "auctions"."id" = $3  [["title", "MacOS5 Updated"], ["updated_at", "2020-09-08 21:34:37.223574"], ["id", 62]]

  def destroy
    @auction.destroy
---
DELETE FROM "auctions" WHERE "auctions"."id" = $1  [["id", 62]]

    def set_auction
      @auction = Auction.find(params[:id])
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]