biddr_api/app/controllers/api/v1/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
  def index
    auctions = Auction.order(created_at: :desc)

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
---
  def show
    auction = Auction.find(params[:id])

INSERT INTO "auctions" ("title", "description", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Mac 2010"], ["description", "It is like ne devise "], ["price", 800], ["created_at", "2020-09-08 23:54:51.199939"], ["updated_at", "2020-09-08 23:54:51.199939"], ["user_id", 1]]
---
  def create
    auction = Auction.new auction_params
    auction.user = current_user
    if auction.save

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
---
   def find_auction
    @auction = Auction.find params[:id]